HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxSrc_regdef.h
/** \brief SRC object */
typedef volatile struct _Ifx_SRC
{
       Ifx_SRC_CPU                         CPU;                    /**< \brief 0, */
       Ifx_UReg_8Bit                       reserved_C[20];         /**< \brief C, \internal Reserved */
       Ifx_SRC_SRCR                        SBCU;                   /**< \brief 20, SBCU Service Request (SPB Bus Control Unit)*/
       Ifx_SRC_SRCR                        EBCU;                   /**< \brief 24, EBCU Service Request (BBB Bus Control Unit, on ED and ADAS devices only)*/
       Ifx_UReg_8Bit                       reserved_28[4];         /**< \brief 28, \internal Reserved */
       Ifx_SRC_AGBT                        AGBT;                   /**< \brief 2C, */
       Ifx_SRC_SRCR                        XBAR0;                  /**< \brief 30, SRI Domain 0 Service Request*/
       Ifx_UReg_8Bit                       reserved_34[12];        /**< \brief 34, \internal Reserved */
       Ifx_SRC_CERBERUS                    CERBERUS;               /**< \brief 40, */
       Ifx_UReg_8Bit                       reserved_48[8];         /**< \brief 48, \internal Reserved */
       Ifx_SRC_ASCLIN                      ASCLIN;                 /**< \brief 50, */
       Ifx_UReg_8Bit                       reserved_80[108];       /**< \brief 80, \internal Reserved */
       Ifx_SRC_SRCR                        MTUDONE;                /**< \brief EC, MTU Done Service Request*/
       Ifx_SRC_QSPI                        QSPI;                   /**< \brief F0, */
       Ifx_UReg_8Bit                       reserved_140[56];       /**< \brief 140, \internal Reserved */
       Ifx_SRC_SRCR                        QSPI2HC;                /**< \brief 178, QSPI2 High Speed Capture Service Request*/
       Ifx_SRC_SRCR                        QSPI3HC;                /**< \brief 17C, QSPI3 High Speed Capture Service Request*/
       Ifx_UReg_8Bit                       reserved_180[160];      /**< \brief 180, \internal Reserved */
       Ifx_SRC_I2C                         I2C;                    /**< \brief 220, */
       Ifx_UReg_8Bit                       reserved_230[144];      /**< \brief 230, \internal Reserved */
       Ifx_SRC_CCU6                        CCU6;                   /**< \brief 2C0, */
       Ifx_SRC_GPT12                       GPT12;                  /**< \brief 2E0, */
       Ifx_UReg_8Bit                       reserved_2F8[8];        /**< \brief 2F8, \internal Reserved */
       Ifx_SRC_STM                         STM;                    /**< \brief 300, */
       Ifx_UReg_8Bit                       reserved_318[24];       /**< \brief 318, \internal Reserved */
       Ifx_SRC_FCE                         FCE;                    /**< \brief 330, */
       Ifx_UReg_8Bit                       reserved_334[12];       /**< \brief 334, \internal Reserved */
       Ifx_SRC_DMA                         DMA;                    /**< \brief 340, */
       Ifx_UReg_8Bit                       reserved_470[272];      /**< \brief 470, \internal Reserved */
       Ifx_SRC_GETH                        GETH;                   /**< \brief 580, */
       Ifx_UReg_8Bit                       reserved_5A8[8];        /**< \brief 5A8, \internal Reserved */
       Ifx_SRC_CAN                         CAN;                    /**< \brief 5B0, */
       Ifx_UReg_8Bit                       reserved_630[64];       /**< \brief 630, \internal Reserved */
       Ifx_SRC_VADC                        VADC;                   /**< \brief 670, */
       Ifx_UReg_8Bit                       reserved_770[144];      /**< \brief 770, \internal Reserved */
       Ifx_SRC_ERAY                        ERAY;                   /**< \brief 800, */
       Ifx_UReg_8Bit                       reserved_830[48];       /**< \brief 830, \internal Reserved */
       Ifx_SRC_SRCR                        DMUHOST;                /**< \brief 860, DMU Host Service Request*/
       Ifx_SRC_SRCR                        DMUFSI;                 /**< \brief 864, DMU FSI Service Request*/
       Ifx_UReg_8Bit                       reserved_868[8];        /**< \brief 868, \internal Reserved */
       Ifx_SRC_HSM                         HSM;                    /**< \brief 870, */
       Ifx_UReg_8Bit                       reserved_878[8];        /**< \brief 878, \internal Reserved */
       Ifx_SRC_SCU                         SCU;                    /**< \brief 880, */
       Ifx_UReg_8Bit                       reserved_890[28];       /**< \brief 890, \internal Reserved */
       Ifx_SRC_SRCR                        PMSDTS;                 /**< \brief 8AC, PMS DTS Service Request*/
       Ifx_SRC_PMS                         PMS;                    /**< \brief 8B0, */
       Ifx_SRC_SRCR                        SCR;                    /**< \brief 8C0, Stand By Controller Service Request*/
       Ifx_UReg_8Bit                       reserved_8C4[12];       /**< \brief 8C4, \internal Reserved */
       Ifx_SRC_SMU                         SMU;                    /**< \brief 8D0, */
       Ifx_UReg_8Bit                       reserved_8DC[36];       /**< \brief 8DC, \internal Reserved */
       Ifx_SRC_HSPDM                       HSPDM;                  /**< \brief 900, */
       Ifx_UReg_8Bit                       reserved_90C[100];      /**< \brief 90C, \internal Reserved */
       Ifx_SRC_RIF                         RIF;                    /**< \brief 970, */
       Ifx_SRC_SPU                         SPU;                    /**< \brief 980, */
       Ifx_SRC_GPSR                        GPSR;                   /**< \brief 990, */
       Ifx_UReg_8Bit                       reserved_9F0[5648];     /**< \brief 9F0, \internal Reserved */
} Ifx_SRC;

/** \}  */
/******************************************************************************/
/** \}  */


/******************************************************************************/

/******************************************************************************/

#endif /* IFXSRC_REGDEF_H */
